STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.h
/** @defgroup ADF_Exported_Types_Group2 ADF handle structure
  * @{
  */

typedef struct hal_adf_handle_s hal_adf_handle_t; /*!< ADF handle type definition */

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
typedef void (*hal_adf_cb_t)(hal_adf_handle_t *, hal_adf_block_index_t); /*!< Pointer to generic callback */
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */

/**
  * @brief HAL ADF handle structure definition.
  */
struct hal_adf_handle_s
{
  /*! Peripheral instance */
  hal_adf_t                                 instance;
  /*! Global state */
  volatile hal_adf_state_t                  global_state;
  /*! Serial interfaces states */
  volatile hal_adf_serial_interface_state_t serial_interface_states[ADF1_BLOCKS_NUMBER];
  /*! Digital filters states */
  volatile hal_adf_digital_filter_state_t   digital_filter_states[ADF1_BLOCKS_NUMBER];
  /*! Sound activity detectors states */
  volatile hal_adf_sad_state_t              sound_activity_detector_states[ADF1_BLOCKS_NUMBER];
#if defined (USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
  /*! Errors limited to the last process. This parameter can be a combination of @ref ADF_Error_Codes */
  volatile uint32_t                         last_error_codes[ADF1_BLOCKS_NUMBER];
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */
#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
  /*! DMA handles */
  hal_dma_handle_t                         *hdma[ADF1_BLOCKS_NUMBER];
#endif /* USE_HAL_ADF_DMA */
#if defined (USE_HAL_ADF_USER_DATA) && (USE_HAL_ADF_USER_DATA == 1)
  /*! User data pointer */
  const void                               *p_user_data;
#endif /* USE_HAL_ADF_USER_DATA */
#if defined (USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
  /*! Acquisition complete callback */
  hal_adf_cb_t                              p_acquisition_cplt_cb;
  /*! Acquisition half complete callback */
  hal_adf_cb_t                              p_acquisition_half_cplt_cb;
  /*! Acquisition stop callback */
  hal_adf_cb_t                              p_acquisition_stop_cb;
  /*! Sound level callback */
  hal_adf_cb_t                              p_sound_level_cb;
  /*! Sound activity callback */
  hal_adf_cb_t                              p_sound_activity_cb;
  /*! Error callback */
  hal_adf_cb_t                              p_error_cb;
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
};

/**
  * @}
  */

/** @defgroup ADF_Exported_Types_Group3 ADF configuration structures
  * @{
  */

/**
  * @brief HAL ADF serial interface configuration structure definition.
  */
typedef struct
{
  hal_adf_serial_interface_mode_t         mode;         /*!< Serial interface mode */
  hal_adf_serial_interface_clock_source_t clock_source; /*!< Serial interface clock source */
  uint32_t                                threshold;    /*!< Threshold for clock absence detection or manchester symbol
                                                             threshold. This parameter must be a number between
                                                             Min_Data = 4 and Max_Data = 31 */
} hal_adf_serial_interface_config_t;

/**
  * @brief HAL ADF digital filter trigger configuration structure definition.
  */
typedef struct
{
  hal_adf_dflt_trigger_source_t source; /*!< Trigger source */
  hal_adf_dflt_trigger_edge_t   edge;   /*!< Trigger edge */
} hal_adf_dflt_trigger_config_t;

/**
  * @brief HAL ADF digital filter configuration structure definition.
  */
typedef struct
{
  hal_adf_dflt_data_source_t      data_source;      /*!< Data source */
  hal_adf_dflt_cic_mode_t         cic_mode;         /*!< CIC mode */
  uint32_t                        decimation_ratio; /*!< Decimation ratio. This parameter must be a number between
                                                         Min_Data = 2 and Max_Data = 512 */
  int32_t                         gain;             /*!< Gain in step of around 3db (from -48db to 72dB).
                                                         This parameter must be a number between Min_Data = -16
                                                         and Max_Data = 24 */
  hal_adf_dflt_acquisition_mode_t acquisition_mode; /*!< Acquisition mode */
  hal_adf_dflt_trigger_config_t   trigger;          /*!< Trigger configuration */
} hal_adf_digital_filter_config_t;

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
/**
  * @brief HAL ADF DMA configuration structure definition.
  */
typedef struct
{
  uint32_t                      address;          /*!< Destination address */
  uint32_t                      data_length_byte; /*!< Data length in bytes */
  hal_adf_dma_data_resolution_t data_resolution;  /*!< Data resolution */
} hal_adf_dma_config_t;
#endif /* USE_HAL_ADF_DMA */

/**
  * @brief HAL ADF sound activity detector configuration structure definition.
  */
typedef struct
{
  hal_adf_sad_mode_t            mode;                  /*!< mode */
  hal_adf_sad_memory_transfer_t memory_transfer;       /*!< Memory transfer */
  hal_adf_sad_trigger_event_t   trigger_event;         /*!< Trigger event */
  uint32_t                      minimum_ambient_noise; /*!< Minimum ambient noise level.
                                                            This parameter must be a number between Min_Data = 0
                                                            and Max_Data = 8191 */
} hal_adf_sad_config_t;

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup ADF_Exported_Functions ADF exported functions
  * @{
  */

/** @defgroup ADF_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */
hal_status_t HAL_ADF_Init(hal_adf_handle_t *hadf, hal_adf_t instance);
void         HAL_ADF_DeInit(hal_adf_handle_t *hadf);
/**
  * @}
  */

/** @defgroup ADF_Exported_Functions_Group2 Common clock generator and features functions
  * @{
  */
/* Configuration functions */
hal_status_t HAL_ADF_SetConfig(hal_adf_handle_t *hadf, uint32_t proc_clock_divider);
void         HAL_ADF_GetConfig(const hal_adf_handle_t *hadf, uint32_t *p_proc_clock_divider);

hal_status_t HAL_ADF_SetConfigOutputClock(const hal_adf_handle_t *hadf, hal_adf_output_clock_pins_t pins,
                                          uint32_t output_clock_divider);
void         HAL_ADF_GetConfigOutputClock(const hal_adf_handle_t *hadf, hal_adf_output_clock_pins_t *p_pins,
                                          uint32_t *p_output_clock_divider);

hal_status_t HAL_ADF_SetConfigOutputClockTrigger(const hal_adf_handle_t *hadf,
                                                 hal_adf_output_clock_trigger_source_t source,
                                                 hal_adf_output_clock_trigger_edge_t edge);
void         HAL_ADF_GetConfigOutputClockTrigger(const hal_adf_handle_t *hadf,
                                                 hal_adf_output_clock_trigger_source_t *p_source,
                                                 hal_adf_output_clock_trigger_edge_t *p_edge);

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
hal_status_t HAL_ADF_SetDMA(hal_adf_handle_t     *hadf,
                            hal_adf_block_index_t block_index,
                            hal_dma_handle_t     *hdma);
#endif /* USE_HAL_ADF_DMA */

uint32_t     HAL_ADF_GetClockFreq(const hal_adf_handle_t *hadf);

#if defined (USE_HAL_ADF_USER_DATA) && (USE_HAL_ADF_USER_DATA == 1)
void        HAL_ADF_SetUserData(hal_adf_handle_t *hadf, const void *p_user_data);
const void *HAL_ADF_GetUserData(const hal_adf_handle_t *hadf);
#endif /* USE_HAL_SAI_USER_DATA */

