STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.h
#if defined(USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
uint32_t     HAL_ADF_GetLastErrorCodes(const hal_adf_handle_t *hadf,
                                       hal_adf_block_index_t   block_index);
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

/* Control functions */
hal_status_t                          HAL_ADF_EnableOutputClock(const hal_adf_handle_t *hadf,
                                                                hal_adf_output_clock_pins_t pins);
hal_status_t                          HAL_ADF_DisableOutputClock(const hal_adf_handle_t *hadf,
                                                                 hal_adf_output_clock_pins_t pins);
hal_adf_output_clock_status_t         HAL_ADF_IsEnabledOutputClock(const hal_adf_handle_t *hadf);

hal_status_t                          HAL_ADF_EnableOutputClockTrigger(const hal_adf_handle_t *hadf);
hal_status_t                          HAL_ADF_DisableOutputClockTrigger(const hal_adf_handle_t *hadf);
hal_adf_output_clock_trigger_status_t HAL_ADF_IsEnabledOutputClockTrigger(const hal_adf_handle_t *hadf);

hal_status_t                          HAL_ADF_EnableTriggerOutput(const hal_adf_handle_t *hadf);
hal_adf_trigger_output_status_t       HAL_ADF_IsEnabledTriggerOutput(const hal_adf_handle_t *hadf);

/* Process functions */
hal_status_t HAL_ADF_Start(hal_adf_handle_t *hadf);
hal_status_t HAL_ADF_Stop(hal_adf_handle_t *hadf);
/**
  * @}
  */

/** @defgroup ADF_Exported_Functions_Group3 Serial interface functions
  * @{
  */
/* Configuration functions */
hal_status_t HAL_ADF_SITF_SetConfig(hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t serial_interface_index,
                                    const hal_adf_serial_interface_config_t *p_config);
void         HAL_ADF_SITF_GetConfig(const hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t serial_interface_index,
                                    hal_adf_serial_interface_config_t *p_config);

/* Process functions */
hal_status_t HAL_ADF_SITF_Start(hal_adf_handle_t *hadf, hal_adf_block_index_t serial_interface_index);
hal_status_t HAL_ADF_SITF_Stop(hal_adf_handle_t *hadf, hal_adf_block_index_t serial_interface_index);

/* Clock absence detection functions */
hal_adf_sitf_ckab_status_t HAL_ADF_SITF_IsClockAbsenceDetected(const hal_adf_handle_t *hadf,
                                                               hal_adf_block_index_t serial_interface_index);

hal_status_t HAL_ADF_SITF_StartClockAbsenceDetect_IT(const hal_adf_handle_t *hadf,
                                                     hal_adf_block_index_t serial_interface_index);
hal_status_t HAL_ADF_SITF_StopClockAbsenceDetect_IT(const hal_adf_handle_t *hadf,
                                                    hal_adf_block_index_t serial_interface_index);
/**
  * @}
  */

/** @defgroup ADF_Exported_Functions_Group4 Bitstream matrix functions
  * @{
  */
/* Configuration functions */
hal_status_t HAL_ADF_BSMX_SetConfig(const hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t bitstream_matrix_index,
                                    hal_adf_block_index_t serial_interface_index,
                                    hal_adf_bitstream_input_edge_t edge);
void         HAL_ADF_BSMX_GetConfig(const hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t bitstream_matrix_index,
                                    hal_adf_block_index_t *p_serial_interface_index,
                                    hal_adf_bitstream_input_edge_t *p_edge);
/**
  * @}
  */

/** @defgroup ADF_Exported_Functions_Group5 Digital filter functions
  * @{
  */
/* Configuration functions */
hal_status_t HAL_ADF_DFLT_SetConfig(hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t digital_filter_index,
                                    const hal_adf_digital_filter_config_t *p_config);
void         HAL_ADF_DFLT_GetConfig(const hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t digital_filter_index,
                                    hal_adf_digital_filter_config_t *p_config);

hal_status_t HAL_ADF_DFLT_SetSamplesDelay(const hal_adf_handle_t *hadf,
                                          hal_adf_block_index_t digital_filter_index,
                                          uint32_t samples_delay);
uint32_t     HAL_ADF_DFLT_GetSamplesDelay(const hal_adf_handle_t *hadf,
                                          hal_adf_block_index_t digital_filter_index);

hal_status_t HAL_ADF_DFLT_SetGain(const hal_adf_handle_t *hadf,
                                  hal_adf_block_index_t digital_filter_index,
                                  int32_t gain);
int32_t      HAL_ADF_DFLT_GetGain(const hal_adf_handle_t *hadf,
                                  hal_adf_block_index_t digital_filter_index);

hal_status_t                  HAL_ADF_DFLT_SetFifoThreshold(const hal_adf_handle_t *hadf,
                                                            hal_adf_block_index_t digital_filter_index,
                                                            hal_adf_dflt_fifo_threshold_t fifo_threshold);
hal_adf_dflt_fifo_threshold_t HAL_ADF_DFLT_GetFifoThreshold(const hal_adf_handle_t *hadf,
                                                            hal_adf_block_index_t digital_filter_index);

hal_status_t HAL_ADF_DFLT_SetDiscardSamples(const hal_adf_handle_t *hadf,
                                            hal_adf_block_index_t digital_filter_index,
                                            uint32_t discard_samples);
uint32_t     HAL_ADF_DFLT_GetDiscardSamples(const hal_adf_handle_t *hadf,
                                            hal_adf_block_index_t digital_filter_index);

/* Control functions */
hal_status_t HAL_ADF_DFLT_EnableReshapeFilter(const hal_adf_handle_t *hadf,
                                              hal_adf_block_index_t digital_filter_index,
                                              hal_adf_dflt_rsf_decimation_ratio_t decimation_ratio);
hal_status_t HAL_ADF_DFLT_DisableReshapeFilter(const hal_adf_handle_t *hadf,
                                               hal_adf_block_index_t digital_filter_index);
hal_adf_dflt_rsf_status_t HAL_ADF_DFLT_IsEnabledReshapeFilter(const hal_adf_handle_t *hadf,
                                                              hal_adf_block_index_t digital_filter_index);
hal_adf_dflt_rsf_decimation_ratio_t HAL_ADF_DFLT_GetReshapeFilterDecimationRatio(const hal_adf_handle_t *hadf,
    hal_adf_block_index_t digital_filter_index);

hal_status_t HAL_ADF_DFLT_EnableHighPassFilter(const hal_adf_handle_t *hadf,
                                               hal_adf_block_index_t digital_filter_index,
                                               hal_adf_dflt_hpf_cut_off_frequency_t cut_off_frequency);
hal_status_t HAL_ADF_DFLT_DisableHighPassFilter(const hal_adf_handle_t *hadf,
                                                hal_adf_block_index_t digital_filter_index);
hal_adf_dflt_hpf_status_t HAL_ADF_DFLT_IsEnabledHighPassFilter(const hal_adf_handle_t *hadf,
                                                               hal_adf_block_index_t digital_filter_index);
hal_adf_dflt_hpf_cut_off_frequency_t HAL_ADF_DFLT_GetHighPassFilterCutOffFrequency(const hal_adf_handle_t *hadf,
    hal_adf_block_index_t digital_filter_index);

/* Process functions */
hal_status_t HAL_ADF_DFLT_StartAcq(hal_adf_handle_t *hadf,
                                   hal_adf_block_index_t digital_filter_index);
hal_status_t HAL_ADF_DFLT_StopAcq(hal_adf_handle_t *hadf,
                                  hal_adf_block_index_t digital_filter_index);
hal_status_t HAL_ADF_DFLT_PollForAcq(hal_adf_handle_t *hadf,
                                     hal_adf_block_index_t digital_filter_index,
                                     uint32_t timeout_ms);
int32_t      HAL_ADF_DFLT_GetAcqValue(const hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t digital_filter_index);

hal_status_t HAL_ADF_DFLT_StartAcq_IT(hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t digital_filter_index);
hal_status_t HAL_ADF_DFLT_StopAcq_IT(hal_adf_handle_t *hadf,
                                     hal_adf_block_index_t digital_filter_index);
hal_status_t HAL_ADF_DFLT_StartAcq_IT_Opt(hal_adf_handle_t *hadf,
                                          hal_adf_block_index_t digital_filter_index,
                                          uint32_t interruptions);

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
hal_status_t HAL_ADF_DFLT_StartAcq_DMA(hal_adf_handle_t *hadf,
                                       hal_adf_block_index_t digital_filter_index,
                                       const hal_adf_dma_config_t *p_dma_config);
hal_status_t HAL_ADF_DFLT_StopAcq_DMA(hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t digital_filter_index);
hal_status_t HAL_ADF_DFLT_StartAcq_DMA_Opt(hal_adf_handle_t *hadf,
                                           hal_adf_block_index_t digital_filter_index,
                                           const hal_adf_dma_config_t *p_dma_config,
                                           uint32_t interruptions);
#endif /* USE_HAL_ADF_DMA */
/**
  * @}
  */

