STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.h
/** @defgroup ADF_Exported_Functions_Group6 Sound activity detector functions
  * @{
  */
/* Configuration functions */
hal_status_t HAL_ADF_SAD_SetConfig(hal_adf_handle_t *hadf,
                                   hal_adf_block_index_t sound_activity_detector_index,
                                   const hal_adf_sad_config_t *p_config);
void         HAL_ADF_SAD_GetConfig(const hal_adf_handle_t *hadf,
                                   hal_adf_block_index_t sound_activity_detector_index,
                                   hal_adf_sad_config_t *p_config);

hal_status_t             HAL_ADF_SAD_SetFrameSize(const hal_adf_handle_t *hadf,
                                                  hal_adf_block_index_t sound_activity_detector_index,
                                                  hal_adf_sad_frame_size_t frame_size);
hal_adf_sad_frame_size_t HAL_ADF_SAD_GetFrameSize(const hal_adf_handle_t *hadf,
                                                  hal_adf_block_index_t sound_activity_detector_index);

hal_status_t                  HAL_ADF_SAD_SetLearningFrames(const hal_adf_handle_t *hadf,
                                                            hal_adf_block_index_t sound_activity_detector_index,
                                                            hal_adf_sad_learning_frames_t learning_frames);
hal_adf_sad_learning_frames_t HAL_ADF_SAD_GetLearningFrames(const hal_adf_handle_t *hadf,
                                                            hal_adf_block_index_t sound_activity_detector_index);

hal_status_t HAL_ADF_SAD_SetSignalToNoiseThreshold(const hal_adf_handle_t *hadf,
                                                   hal_adf_block_index_t sound_activity_detector_index,
                                                   hal_adf_sad_signal_to_noise_threshold_t threshold);
hal_adf_sad_signal_to_noise_threshold_t
HAL_ADF_SAD_GetSignalToNoiseThreshold(const hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t sound_activity_detector_index);

hal_status_t HAL_ADF_SAD_SetAmbientNoiseSlope(const hal_adf_handle_t *hadf,
                                              hal_adf_block_index_t sound_activity_detector_index,
                                              uint32_t ambient_noise_slope);
uint32_t     HAL_ADF_SAD_GetAmbientNoiseSlope(const hal_adf_handle_t *hadf,
                                              hal_adf_block_index_t sound_activity_detector_index);

hal_status_t HAL_ADF_SAD_SetHangoverTimeWindow(const hal_adf_handle_t *hadf,
                                               hal_adf_block_index_t sound_activity_detector_index,
                                               hal_adf_sad_hangover_time_window_t hangover_time_window);
hal_adf_sad_hangover_time_window_t
HAL_ADF_SAD_GetHangoverTimeWindow(const hal_adf_handle_t *hadf,
                                  hal_adf_block_index_t sound_activity_detector_index);

/* Control functions */
hal_status_t                    HAL_ADF_SAD_EnableHysteresis(const hal_adf_handle_t *hadf,
                                                             hal_adf_block_index_t sound_activity_detector_index);
hal_status_t                    HAL_ADF_SAD_DisableHysteresis(const hal_adf_handle_t *hadf,
                                                              hal_adf_block_index_t sound_activity_detector_index);
hal_adf_sad_hysteresis_status_t HAL_ADF_SAD_IsEnabledHysteresis(const hal_adf_handle_t *hadf,
                                                                hal_adf_block_index_t sound_activity_detector_index);

/* Process functions */
hal_status_t         HAL_ADF_SAD_Start(hal_adf_handle_t *hadf,
                                       hal_adf_block_index_t sound_activity_detector_index);
hal_status_t         HAL_ADF_SAD_Stop(hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t sound_activity_detector_index);
hal_adf_sad_status_t HAL_ADF_SAD_IsDetected(const hal_adf_handle_t *hadf,
                                            hal_adf_block_index_t sound_activity_detector_index);
hal_status_t         HAL_ADF_SAD_PollForSoundLevel(hal_adf_handle_t *hadf,
                                                   hal_adf_block_index_t sound_activity_detector_index,
                                                   uint32_t timeout_ms);
void                 HAL_ADF_SAD_GetSoundAndAmbientNoiseLevels(const hal_adf_handle_t *hadf,
                                                               hal_adf_block_index_t sound_activity_detector_index,
                                                               uint32_t *p_sound_level,
                                                               uint32_t *p_ambient_noise_level);

hal_status_t HAL_ADF_SAD_Start_IT(hal_adf_handle_t *hadf,
                                  hal_adf_block_index_t sound_activity_detector_index);
hal_status_t HAL_ADF_SAD_Stop_IT(hal_adf_handle_t *hadf,
                                 hal_adf_block_index_t sound_activity_detector_index);
hal_status_t HAL_ADF_SAD_Start_IT_Opt(hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t sound_activity_detector_index,
                                      uint32_t interruptions);
/**
  * @}
  */

/** @defgroup ADF_Exported_Functions_Group7 IRQ handler and callback functions
  * @{
  */
void HAL_ADF_IRQHandler(hal_adf_handle_t *hadf, hal_adf_block_index_t block_index);
void HAL_ADF_DFLT_AcqCpltCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t digital_filter_index);
void HAL_ADF_DFLT_AcqHalfCpltCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t digital_filter_index);
void HAL_ADF_DFLT_AcqStopCpltCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t digital_filter_index);
void HAL_ADF_SAD_SoundLevelCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t sound_activity_detector_index);
void HAL_ADF_SAD_SoundActivityCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t sound_activity_detector_index);
void HAL_ADF_ErrorCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t block_index);

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
hal_status_t HAL_ADF_DFLT_RegisterAcqCpltCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback);
hal_status_t HAL_ADF_DFLT_RegisterAcqHalfCpltCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback);
hal_status_t HAL_ADF_DFLT_RegisterAcqStopCpltCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback);
hal_status_t HAL_ADF_SAD_RegisterSoundLevelCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback);
hal_status_t HAL_ADF_SAD_RegisterSoundActivityCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback);
hal_status_t HAL_ADF_RegisterErrorCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup ADF_Exported_Functions_Group8 State functions
  * @{
  */
hal_adf_state_t HAL_ADF_GetState(const hal_adf_handle_t *hadf);

hal_adf_serial_interface_state_t HAL_ADF_SITF_GetState(const hal_adf_handle_t *hadf,
                                                       hal_adf_block_index_t serial_interface_index);

hal_adf_digital_filter_state_t HAL_ADF_DFLT_GetState(const hal_adf_handle_t *hadf,
                                                     hal_adf_block_index_t digital_filter_index);

hal_adf_sad_state_t HAL_ADF_SAD_GetState(const hal_adf_handle_t *hadf,
                                         hal_adf_block_index_t sound_activity_detector_index);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5xx_HAL_ADF_H */
